package by.it.task01.Savkin;

public class Main8 {
	public static void main(String[] args) {     //пролезет ли кирпич размерами xyz в заданное отверстие ab
		int a = 11;
		int b = 12;
		int x = 10;
		int y = 12;
		int z = 11;
		if ((a > x) && (b > y)) {
			System.out.println(" кирпич с размерами:" + x + " * " + y + " * " + z + " пролезет в отверстие размером: "
					+ a + " * " + b);
		}

		if ((a > y) && (b > x)) {
			System.out.println(" кирпич с размерами:" + x + " * " + y + " * " + z + " пролезет в отверстие размером: "
					+ a + " * " + b);
		}

		if ((a > x) && (b > z)) {
			System.out.println(" кирпич с размерами:" + x + " * " + y + " * " + z + " пролезет в отверстие размером: "
					+ a + " * " + b);
		}

		if ((a > z) && (b > x)) {
			System.out.println(" кирпич с размерами:" + x + " * " + y + " * " + z + " пролезет в отверстие размером: "
					+ a + " * " + b);
		}

		if ((a > z) && (b > y)) {
			System.out.println(" кирпич с размерами:" + x + " * " + y + " * " + z + " пролезет в отверстие размером: "
					+ a + " * " + b);
		}

		if ((a > y) && (b > z)) {
			System.out.println(" кирпич с размерами:" + x + " * " + y + " * " + z + " пролезет в отверстие размером: "
					+ a + " * " + b);
		}

		else {
			System.out.println(" кирпич с размерами:" + x + " * " + y + " * " + z
					+ " не пролезет в отверстие размером: " + a + " * " + b);
		}
	}
}